<a href="https://colab.research.google.com/github/vfquevedo/ML1/blob/main/series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Importar librerias
import pandas as pd

In [ ]:
# Generar la serie Mango a partir de un vector
naranjas = pd.Series([4, 5, 6, 3, 1])

In [ ]:
# visualizar los elementos de la serie
naranjas

0    4
1    5
2    6
3    3
4    1
dtype: int64

In [ ]:
# Crear una serie a partir de una lista
colores = pd.Series(['rojo', 'verde', 'azul', 'amarillo', 'morado'])
colores

0        rojo
1       verde
2        azul
3    amarillo
4      morado
dtype: object

In [ ]:
# Crear una serie a partir de un diccionario
materias = pd.Series({'Matemáticas': 6, 'Física': 5, 'Química': 4})
materias

Matemáticas    6
Física         5
Química        4
dtype: int64

In [ ]:
# Propiedades de una serie
numeros = pd.Series([9, 18, 27])

In [ ]:
numeros.size

3

In [ ]:
numeros.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
numeros.dtype

dtype('int64')

In [ ]:
# Acceso a una serie a partir de una lista
colores = pd.Series(['rojo', 'verde', 'azul', 'amarillo', 'morado'])
colores

0        rojo
1       verde
2        azul
3    amarillo
4      morado
dtype: object

In [ ]:
# Acceder al color verde
colores[1:2]

1    verde
dtype: object

In [ ]:
# Acceder al amarillo y morado
colores[3:5]

3    amarillo
4      morado
dtype: object

In [ ]:
# Acceso a una serie a partir de un diccionario
materias = pd.Series({'Matemáticas': 6, 'Física': 5, 'Química': 4})
materias

Matemáticas    6
Física         5
Química        4
dtype: int64

In [ ]:
materias['Matemáticas']

6

In [ ]:
materias[['Física','Química']]

Física     5
Química    4
dtype: int64

In [ ]:
# Operaciones básicas
numeros = pd.Series([10, 20, 10])
numeros

0    10
1    20
2    10
dtype: int64

In [ ]:
numeros * 2

0    20
1    40
2    20
dtype: int64

In [ ]:
# Funciones en series
numeros = pd.Series([10, 20, 10, 30, 40, 50, 60, 70, 80, 90])
numeros

0    10
1    20
2    10
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [ ]:
# Suar todos los valores de la serie
numeros.sum()

460

In [ ]:
# Encontrar el valor máximo de la serie
numeros.max()

90

In [ ]:
# Encontrar el valor mínimo de la serie
numeros.min()

10

In [ ]:
# Propiedades de la estadística
numeros.std()

28.751811537130433

In [ ]:
# Propiedades de la estadística
numeros.describe()

count    10.000000
mean     46.000000
std      28.751812
min      10.000000
25%      22.500000
50%      45.000000
75%      67.500000
max      90.000000
dtype: float64

In [ ]:
serie = pd.Series({'Matemáticas': 8, 'Física': 5, 'Química': 7, 'Programación': 9})
serie

Matemáticas     8
Física          6
Química         8
Programación    9
dtype: int64

In [ ]:
# Visualizar las materias mayor a 7
serie[serie > 7]

Matemáticas     8
Química         8
Programación    9
dtype: int64

In [ ]:
# Ordenar los valores
serie.sort_values()

Física          6
Matemáticas     8
Química         8
Programación    9
dtype: int64

In [ ]:
# Ordenar las materias
serie.sort_index(ascending=True)

Física          6
Matemáticas     8
Programación    9
Química         8
dtype: int64

In [ ]:
# Crear una serie usando un escalar
dato = 5
serie =pd.Series(dato, index=[0, 1, 2, 3, 4, 5, 6, 7 ,8])
serie

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
8    5
dtype: int64

In [ ]:
# Crear una serie con un índice definido
dato_lista = ['María', 'Carmen', 'Rosa', 'Isabel']
indice = ['Cuenca', 'Puyo', 'Ambato', 'Quito']
ciudad_residencia = pd.Series(index=indice, data=dato_lista)
ciudad_residencia

Cuenca     María
Puyo      Carmen
Ambato      Rosa
Quito     Isabel
dtype: object